# -*- coding: utf-8 -*-

from datetime import datetime

message = 0
date = 1

BIRTHDAYS_LIST = [
    ['''Хьюстон, а у нас то проблема, ваша Лися проеб.... запамятовала про день рождения нашего дорого @westhallen
Мне безумно стыдно😔 простите меня
Давай мы его поздравим с прошедшим праздником (оно было 28 февраля)
Игорь @westhallen, с прошедшим дней рождения тебя. Хочется пожелать чтобы в твоей жизни была та яркая звезда, что покажет тебе путь на спокойную жизнь и будет поддерживать тебя, чтобы ты прокатился с нами на Марс😂 и конечно же не пей много, только по праздникам☺️
Ну и естественно традиционно #щассцяздароуя 😘💋
С днём рождения @westhallen
Прошу оффтоп присоединиться к поздравлениям☺️🤪🥳🤩''',
     datetime(2019, 3, 2, 19, 5)],
    ['''ПОЗДРАВЛЯЮ СебЯ @via_tcp ПОТОМУ ЧТО ТАК ХОЧУ, РОДИЛСЯ ВДРУГ В 18:50!!! :D''',
     datetime(2019, 3, 2, 18, 51)]
]
